app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT * FROM "blogs"

  def show
    @blog = Blog.find(params[:id])
---
SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)

  def create
    @blog = Blog.new(params[:blog])

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("created_at", "title", "post", "updated_at") VALUES('2010-01-06 22:29:39', 'title 1', 'post for title 1', '2010-01-06 22:29:39')