app/controllers/grocery_lists_controller.rb

  def index
    @grocery_lists = GroceryList.all
---
SELECT * FROM "grocery_lists"

  def show
    @grocery_list = GroceryList.find(params[:id])
---
SELECT * FROM "grocery_lists" WHERE ("grocery_lists"."id" = 1)

  def edit
    @grocery_list = GroceryList.find(params[:id])
---
SELECT * FROM "grocery_lists" WHERE ("grocery_lists"."id" = 1)

  def sort
    @grocery_list = GroceryList.find(params[:id])
    @grocery_list.food_items.each do | f |
---
SELECT * FROM "grocery_lists" WHERE ("grocery_lists"."id" = 4)
SELECT * FROM "food_items" WHERE ("food_items".grocery_list_id = 4) ORDER BY position

  def create
    @grocery_list = GroceryList.new(params[:grocery_list])

    respond_to do |format|
      if @grocery_list.save

        (1..10).each do |i|
          food_item = FoodItem.new(:name => "Item %i" % i, :grocery_list_id => @grocery_list.id, :position => i )
          @grocery_list.food_items << food_item
---
INSERT INTO "grocery_lists" ("name", "created_at", "updated_at") VALUES('Main List', '2010-01-05 05:54:41', '2010-01-05 05:54:41')
INSERT INTO "food_items" ("name", "position", "created_at", "updated_at", "grocery_list_id") VALUES('Item 1', 1, '2010-01-05 05:59:38', '2010-01-05 05:59:38', 4)

  def update
    @grocery_list = GroceryList.find(params[:id])
---
SELECT * FROM "grocery_lists" WHERE ("grocery_lists"."id" = 953125641)

  def destroy
    @grocery_list = GroceryList.find(params[:id])
    @grocery_list.destroy
---
SELECT * FROM "grocery_lists" WHERE ("grocery_lists"."id" = 1)
DELETE FROM "grocery_lists" WHERE "id" = 1