app/controllers/in_place_editor_controller.rb

SELECT * FROM "in_place_editors" WHERE ("in_place_editors"."id" = 1)
---
  def show
    @in_place_editor = InPlaceEditor.find(params[:id])

SELECT * FROM "in_place_editors"
---
  def index
    @in_place_editors = InPlaceEditor.all