app/controllers/pagination_controller.rb

  def index
    @pagination_items = PaginationItem.paginate :per_page => 5,
                                                :page => params[:page],
                                                :conditions => [ 'name like ?', "%#{params[:search]}" ],
                                                :order => :name
---
SELECT * FROM "pagination_items" WHERE (name like '%') ORDER BY name LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "pagination_items" WHERE (name like '%')