app/controllers/tag_users_controller.rb

  def index
    @tag_users = TagUser.all
---
SELECT * FROM "tag_users"

  def show
    @tag_user = TagUser.find(params[:id])
---
SELECT * FROM "tag_users" WHERE ("tag_users"."id" = 5)

  def create
    @tag_user = TagUser.new(params[:tag_user])

    respond_to do |format|
      if @tag_user.save
---
INSERT INTO "tag_users" ("name", "created_at", "updated_at", "skills", "tags") VALUES(NULL, '2010-01-12 00:40:17', '2010-01-12 00:40:17', NULL, NULL)